-bot-name = EZvpn

welcome = سلام { $name } عزیز
    به *{ -bot-name }* خوش اومدید
    جهت استفاده از ربات بر روی /menu کلیک کنید

welcome-back = کاربر { $name } عزیز
    جهت استفاده از ربات بر روی /menu کلیک کنید

language = انتخاب زبان
    .specify-a-locale = لطفا یک زبان را انتخاب کنید
    .invalid-locale = زبان وارد شده نامعتبر است
    .already-set = این زبان از قبل ست شده است
    .language-set = ✅ زبان شما با موفقیت به { $lang } تغییر یافت

menu = 🔻 از منوی زیر انتخاب کنید
    .prices-btn = 💰 تعرفه‌ها
    .downloads-btn = 📥 مرکز دانلود
    .tutorials-btn = 📚 بخش آموزش
    .diagnosis-btn = ⚙️ عیب‌یابی
    .faq-btn = ❓سوالات متداول
    .servers-btn = 🖥 سرورها
    .support-btn = 💬 پشتیبانی
    .account-btn = 🕹 حساب کاربری
    .agency-btn = 💰 پنل فروش
    


back-to-home-btn = 🏠 صفحه اصلی
back-btn = ↩️ برگشت
prev-page = صفحه قبل
next-page = صفحه بعد



faq = 🔻 از منوی زیر انتخاب کنید
diagnosis = 🔻 از منوی زیر انتخاب کنید

prices = نوع کاربری خود را انتخاب کنید:
    .daily = 🔻 پکیج Daily مناسب برای وب گردی، شبکه های اجتماعی، دانلود و آپلود و سایر کارهای روزمره عادی استفاده می شود.
        🔻 این پکیج دارای دو نوع سرویس می باشد: دیلی و دیلی پلاس
        🔻 تفاوت سرویس دیلی پلاس در تعداد سرورها، کیفیت سرورها و همچنین توانایی استفاده در مواقع حساس می باشد.

        💰 تعرفه های پکیج Daily را در بخش خرید سرویس می توانید مشاهده کنید
        
    .trade = 🔻 پکیج Trade مناسب برای تریدرها می باشد.
        🔻 این پکیج برای وبگردی، دانلود و شبکه های اجتماعی مناسب نیست.
        🔻 این پکیج دارای آیپی ثابت و بدون هرگونه نشتی ip و dns می باشد.
        🔻 سرویس Trade+ مناسب برای گروه ها، دفاتر و شرکت های ترید می باشد که توانایی پاسخگویی حداقل ۵۰ دیوایس را دارد.

        💰 با پشتیبانی در ارتباط باشید

    .game = 🔻 پکیج Game مناسب برای گیمرها می باشد.
        🔻 این پکیج برای وبگردی، دانلود و شبکه های اجتماعی مناسب نیست.
        🔻 این پکیج دارای پینگ عالی برای اتصال کامل در بازی های مختلف می باشد.
        🔻 سرویس Game+ مناسب برای گروه ها و کلاب های بازی می باشد که توانایی پاسخگویی به حداقل ۵۰ کاربر را داراست.

        💰 با پشتیبانی در ارتباط باشید





downloads = 🔻 از منوی زیر انتخاب کنید
tutorials = 🔻 از منوی زیر انتخاب کنید


connect-account-btn = 🔗 اتصال اکانت
create-account-btn = 📝 ثبت نام




