-bot-name = EZvpn

welcome = سلام { $name } عزیز
    به *{ -bot-name }* خوش اومدید
    جهت استفاده از ربات بر روی /menu کلیک کنید

welcome-back = کاربر { $name } عزیز
    جهت استفاده از ربات بر روی /menu کلیک کنید

language = انتخاب زبان
    .specify-a-locale = لطفا یک زبان را انتخاب کنید
    .invalid-locale = زبان وارد شده نامعتبر است
    .already-set = این زبان از قبل ست شده است
    .language-set = ✅ زبان شما با موفقیت به { $lang } تغییر یافت

menu = 🔻 از منوی زیر انتخاب کنید
    .prices-btn = 💰 تعرفه‌ها
    .downloads-btn = 📥 مرکز دانلود
    .tutorials-btn = 📚 بخش آموزش
    .diagnosis-btn = ⚙️ عیب‌یابی
    .faq-btn = ❓سوالات متداول
    .servers-btn = 🖥 سرورها
    .support-btn = 💬 پشتیبانی
    .myaccount-btn = 🕹 حساب من


back-to-home-btn = صفحه اصلی 🏠
back-btn = برگشت ↩️

faq = 🔻 از منوی زیر انتخاب کنید
diagnosis = 🔻 از منوی زیر انتخاب کنید
